crossdict-readme-cn.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>CrossDict: 交叉索引字典</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="CrossDict: 交叉索引字典"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-03-08 16:19:21 CST"/>
<meta name="author" content="Bao Haojun"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="css/default.css" type="text/css">
 <link rel="shortcut icon" href="/poison.png" type="image/png" />


</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">CrossDict: 交叉索引字典</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 CrossDict是自由软件</a></li>
<li><a href="#sec-2">2 CrossDict很酷</a></li>
<li><a href="#sec-3">3 CrossDict会变得更酷</a></li>
<li><a href="#sec-4">4 CrossDict的开发过程很酷</a></li>
<li><a href="#sec-5">5 请支持</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> CrossDict是自由软件</h2>
<div class="outline-text-2" id="text-1">


<p>
这是一款Android上的字典软件，你可以在 <a href="https://play.google.com/store/apps/details?id=com.baohaojun.crossdict">Google Play</a> 上安装，或者如果你的
手机不支持Google Play的话，你可以上 <a href="http://vdisk.weibo.com/s/skNbH">新浪微盘</a> 下载这个APK。
</p>
<p>
这是一款自由软件。
</p>
<p>
它的字典数据来自于 <a href="ftp://ftp.gnu.org/gnu/gcide/">GCIDE</a> ，一个GNU项目，所以也是自由的。我修正了 <a href="http://puszcza.gnu.org.ua/software/dico/">dico</a>
的一些bug，并用它来从GCIDE里抽取出我需要的字典数据（以HTML格式呈现）。
我对dico的改动在<a href="https://github.com/baohaojun/dico">这个github项目里</a>。
</p>
<p>
但是它也支持切换字典数据，比如American Heritage Dictionary的字典数据。
当然你需要把它改成CrossDict的数据格式。我以后会写一个脚本，争取可以从
StarDict的字典数据生成CrossDict需要的格式。
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> CrossDict很酷</h2>
<div class="outline-text-2" id="text-2">


<p>
我开发了一些我认为所有字典软件都应该有的功能：
</p>
<ul>
<li>搜索定义中的引用

<p>
   比如，你可以搜哪些单词在它们的词条解释中使用了“Hello”这个单词。这也
   是此软件的名字的由来。这个功能对我们理解一个单词如何使用、造句很有帮
   助。
</p>
</li>
<li>正则表达式搜索

<p>   
   比如，你可以用“let$”去搜出所有的以 <code>let</code> 结尾的小东西（-let作为词根
   表示一件事物的比较小的体现，比如booklet&ndash;小册子）。这对我们通过字根
   学习掌握更多单词很有帮助。
</p>
</li>
<li>上下文菜单

<p>
   在这个字典软件中，你长按字条解释中的任意一个单词，都会弹出一个菜单，
   允许你搜索该单词的解释、引用、匹配。这个功能的实现要感谢 <a href="https://github.com/btate/BTAndroidWebViewSelection">这个github项目</a> 。事实上你可能注意到了我的CrossDict是此项目的一个 <a href="https://github.com/btate/BTAndroidWebViewSelection/network">fork</a> 。
</p></li>
</ul>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> CrossDict会变得更酷</h2>
<div class="outline-text-2" id="text-3">


<p>
目前我正继续开发这些features:
</p>
<ul>
<li>支持更多的设备

<p>
   目前只支持 Android 4.0 或更高版本。
</p>
</li>
<li>支持单词截取、生词列表

<p>
   Android里内置社交分享功能可以为我的CrossDict所用，比如我目前在用
   fbreader看英文原版的指环王，它支持选定一个单词然后分享给别的软件，如
   果我能让CrossDict接收这样的分享，查生词岂不是变得简单到不能再简单？
</p>
</li>
<li>把字典数据与App分开

<p>
   目前的状态App自带字典数据，这样能让大家装上就可以用，但是对App升级是
   很不利的，字典数据如果不升级的话不应该需要下载那么大的Apk包。
</p></li>
</ul>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> CrossDict的开发过程很酷</h2>
<div class="outline-text-2" id="text-4">


<p>
  我用的是Emacs而不是Eclipse来开发这款Apk。事实上，这是我的第一个认真的
  Java程序。以前一直没写过比较大的Java程序，原因是我是一个Emacs死忠用户，
  切换到Eclipse去做Java/Android开发的想法简直让我抓狂。
</p>
<p>
  后来我试着用了 <a href="https://github.com/senny/emacs-eclim">emacs-eclim</a> 。这个软件很不错，开发普通的Java/Android程
  序足够用了。但它不能满足我的胃口。我希望能把整个Android源码放到一个
  Eclim项目中进行开发&ndash;结果后台的Eclipse就开始爬了。
</p>
<p>
  但是不管怎么说，我很感谢 emacs-eclim 给了我灵感，我开始用 <a href="http://www.gnu.org/software/global/">gtags</a> 和
  <a href="http://ctags.sourceforge.net/">exuberant ctags</a> 自己搞了一套Emacs/Android的开发环境。
</p>
<p>
  这套开发环境还没有完成到可以让大家很方便的用的程度（有人会觉得遗憾
  吗？:-)），但是你可以在 <a href="http://baohaojun.github.com/coding-android-java-in-emacs-en.html">这里</a> 看一下简介（英文版，内有使用视频链接）。
</p>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 请支持</h2>
<div class="outline-text-2" id="text-5">


<p>
如果你喜欢CrossDict、想支持我的工作的话，请点 <a href="http://baohaojun.github.com/donate.html">这里</a> 了解给我捐款的方法。
非常感谢！
</p></div>
</div>
</div>

<div id="postamble">
    <hr/>
    <div style="float:left;width:160px;">
    <iframe width="100%" height="75" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=550&fansRow=2&ptype=1&speed=0&skin=1&isTitle=0&noborder=0&isWeibo=0&isFans=0&uid=1611427581&verifier=936f3b91&dpc=1"></iframe>
    </div>
    <div id="jiathis_style_32x32" style="float:left;margin-left:20px;margin-top:35px;">
        <a class="jiathis_button_tsina"></a>
        <a class="jiathis_button_douban"></a>
        <a class="jiathis_button_tqq"></a>
        <a class="jiathis_button_renren"></a>
        <a class="jiathis_button_douban9dian"></a>
        <!--<a class="jiathis_button_readitlater"></a>-->
        <!--<a class="jiathis_button_instapaper"></a>-->
        <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jtico jtico_jiathis" target="_blank"></a>
        <!--<a class="jiathis_counter_style"></a>-->
    </div>
<script type="text/javascript">
    $(document).ready(function(){
        BYB.includeScript('http://v2.jiathis.com/code/jia.js',function(){})
    });
</script>


</div>
</body>
</html>
